app/controllers/user_sessions_controller.rb

INSERT INTO "users" ("name", "created_at", "crypted_password", "perishable_token", "updated_at", "password_salt", "current_login_at", "persistence_token", "login", "last_login_at", "active", "email") VALUES('Sheldon Cooper', '2009-11-11 23:57:41', '78d2c255e4e0aee1db7a6138ed53f9d5f9a793ca41edf9e08d571ba4c3e629f42afb44fc14609093f1cb30afaa5435cccf7c5e17862cb4c048741a54dd6dff6a', 'USkpo4BanBYI8jD98qcY', '2009-11-11 23:57:41', 'RgIOl9An-UMd8CyJPkJu', '2009-11-11 23:57:41', '07a6202e649f1d601c0fc31caae150ebaadcaf0fbecf7036ca863ab09e3a265b28be6631f5488c28a5263801c8b794f2a48a6f52a29e2ce4cd4ab3382b6267aa', 'sheldon', NULL, 't', 'sheldon@bbt.com')
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save