app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "crypted_password", "perishable_token", "updated_at", "password_salt", "current_login_at", "persistence_token", "login", "last_login_at", "active", "email") VALUES('Sheldon Cooper', '2009-11-11 23:57:42', '64e82833892537856993a7f56e2336edfad88493133641ced30f3f524493e60e2a4ef7eaa3cbf9b1e4a6718ee8599aa33a61d1a07699dd802e9b7e966cd5640e', 'PvCg3uxOcTWHyNGVFkDd', '2009-11-11 23:57:42', 'G1ZYPejyPckiX_DgkYAU', '2009-11-11 23:57:42', 'cb7637361ae3ed941d44223442232edfac79dbf1245f86abbfea68e28b072446b5f2287fa37820f3ef0e7e7013d93d4ad2a5658d8697ab66d763a60c11138c44', 'sheldon', NULL, 't', 'sheldon@bbt.com')
---
  def create
    @user = User.new(params[:user])

    if @user.save

UPDATE "users" SET "updated_at" = '2009-11-12 02:35:25', "perishable_token" = 'kq5wLoVPfK92PADcKV0t', "name" = 'Modified' WHERE "id" = 2
---
  def update
    if current_user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."perishable_token" = 'Zy6gPCGHecvEaebSBx30') LIMIT 1
INSERT INTO "users" ("name", "created_at", "crypted_password", "perishable_token", "updated_at", "password_salt", "current_login_at", "persistence_token", "login", "last_login_at", "active", "email") VALUES('Sheldon Cooper', '2009-11-11 23:57:42', 'dd73cacbbda7aa619d15debc0b51bcffe4addd88e972d5667eba5fb530ddd87dda1efe841f2e96493217990c8a6ce94f0a89710449e15b9e9f9f90215f6a70be', 'CMXUuaEGQWGKyFMRd1qy', '2009-11-11 23:57:42', 'tvL4LU2BiL-qHAGDeWev', '2009-11-11 23:57:42', '53cbc6f848ac2a8dd120645b7e56fe829933cf086b57917560762f61369bbec0a0459e9044e336e2cb64a897b4d53c3124bfc09e53c0eed3fab545ffa264f0ff', 'sheldon', NULL, 't', 'sheldon@bbt.com')
---
  def activate
    if @user = User.find_by_perishable_token(params[:activation_token])
      @user.activate!

      # Log the user in
      UserSession.create(@user)

SELECT "users".id FROM "users" WHERE (LOWER("users"."login") = 'sheldon') LIMIT 1
---
  def find_user
    @user = User.find_by_login!(params[:id])